package com.company;
                            //მრავალგანზომილებიანი მასივი არის მასივების მასივი
public class Main {

    public static void main(String[] args) {
    int[][] array = new int[4][2];   //ჩვენ გვაქვს მასივების მასივი პირველი მასივი რომელიც არის 4 ელემენტიანი მეორე მასივი 2 ელემენტიანი
array[0][0] = 1;
        System.out.println(array[0][0]);

        //მასივის ინციალიზაცია მეორე ნაირად
        int[][] array2 ={ {5,6,4} , {6,10,15}}; //გვაქვს მასივების მასივი 2 ცალი
        for(int i=0; i<2; i++){
            for(int j = 0; j<3; j ++){
                System.out.print(array2[i][j] + " ");
            }
        }
        System.out.println();

        //ჩვენ ასევე შეგძლია გავაკეთოთ ორ განზომილებიანი მასივები სხავდასხვა ზომის
        int[][] array3 = new int[2][] ; //ჩვენ გვაკვს ორ განზომილებიანი მასივი
        array3[0] = new int[10]; //პირველი ელემენტის  ქვე მასივის სიგრძე იქნება 10  ანუ 10ელემენტის შენახვა შეეძლება
        array3[1] = new int[4]; //მეორე ელემენტის სიგრძე იქნება 4 ანუ 4 ელემენტის შენახვა შეეძლება
    }
}
